#Использовать "../src/cmd"
#Использовать 1commands
#Использовать cli
#Использовать v8runner
#Использовать v8storage
#Использовать yadisk
#Использовать logos
#Использовать asserts
#Использовать fs
#Использовать tempfiles
#Использовать moskito

Перем ЮнитТест;
Перем ПодключениеКСУБД;
Перем МокИсполнительКоманд;
Перем ВременныйКаталог;
Перем Лог;

// Процедура выполняется после запуска теста
//
Процедура ПередЗапускомТеста() Экспорт
	
	ПодключениеКСУБД = Новый ПодключениеКСУБД("srv", "usr", "");
	
	Лог = Логирование.ПолучитьЛог("ktb.lib.cpdb");
	Лог.УстановитьУровень(УровниЛога.Отладка);

КонецПроцедуры // ПередЗапускомТеста()

// Функция возвращает список тестов для выполнения
//
// Параметры:
//	Тестирование	- Тестер		- Объект Тестер (1testrunner)
//	
// Возвращаемое значение:
//	Массив		- Массив имен процедур-тестов
//	
Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	ЮнитТест = Тестирование;
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестДолжен_СоздатьРезервнуюКопиюБазы");

	Возврат СписокТестов;
	
КонецФункции // ПолучитьСписокТестов()

// Процедура выполняется после запуска теста
//
Процедура ПослеЗапускаТеста() Экспорт

КонецПроцедуры // ПослеЗапускаТеста()
