#Использовать "../src"
#Использовать cmdline
#Использовать ReadParams
#Использовать v8runner
#Использовать yadisk
#Использовать logos
#Использовать asserts
#Использовать moskito

Перем ЮнитТест;
Перем АгентКластера;
Перем Кластер;

// Функция возвращает список тестов для выполнения
//
// Параметры:
//	Тестирование	
Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	ЮнитТест = Тестирование;
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестДолжен_ИнструментыСУБД");

	Возврат СписокТестов;
	
КонецФункции

// Процедура выполняется после запуска теста
//
Процедура ПослеЗапускаТеста() Экспорт

	
КонецПроцедуры // ПослеЗапускаТеста()

// Процедура выполняется после запуска теста
//
Процедура ПередЗапускомТеста() Экспорт
	

КонецПроцедуры

// Процедура - тест
//
Процедура ТестДолжен_ИнструментыСУБД() Экспорт
	
	ИсполнительКоманд = Новый ИнструментыСУБД();

КонецПроцедуры // ТестДолжен_ИнструментыСУБД()

