#Использовать "../src/cmd"
#Использовать 1commands
#Использовать cli
#Использовать v8runner
#Использовать v8storage
#Использовать yadisk
#Использовать logos
#Использовать asserts
#Использовать moskito

Перем ЮнитТест;
Перем АгентКластера;
Перем Кластер;

// Функция возвращает список тестов для выполнения
//
// Параметры:
//	Тестирование	
Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	ЮнитТест = Тестирование;
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестДолжен_СоздатьПодключениеКСУБД");

	Возврат СписокТестов;
	
КонецФункции

// Процедура выполняется после запуска теста
//
Процедура ПослеЗапускаТеста() Экспорт

	
КонецПроцедуры // ПослеЗапускаТеста()

// Процедура выполняется после запуска теста
//
Процедура ПередЗапускомТеста() Экспорт
	

КонецПроцедуры

// Процедура - тест
//
Процедура ТестДолжен_СоздатьПодключениеКСУБД() Экспорт
	
	ПодключениеКСУБД = Новый ПодключениеКСУБД("srv", "usr", "");

КонецПроцедуры // ТестДолжен_ПодключениеКСУБД()

