
Перем Лог;

// Читает сценарии из переданных файлов
//
// Параметры:
//  ФайлыСценариев    - Строка    - перечень путей к файлам, разленных ";"
//
// Возвращаемое значение:
//   Соответствие   - Параметры, прочитанные в соответствие
//
Функция ПрочитатьСценарии(Знач ФайлыСценариев = Неопределено) Экспорт
	
	ПутиКСценариям = СтрРазделить(ФайлыСценариев, ";");

	ПрочитанныеСценарии = Новый Массив;

	Для каждого ТекПуть Из ПутиКСценариям Цикл

		ВремФайл = Новый Файл(ТекПуть);

		Если НЕ (ВремФайл.Существует() И ВремФайл.ЭтоФайл()) Тогда
			Лог.Ошибка("Файл ""%1"" не существует.", ТекПуть);
			Продолжить;
		КонецЕсли;
		
		Чтение = Новый ЧтениеJSON();
		Чтение.ОткрытьФайл(ТекПуть, КодировкаТекста.UTF8);
		
		Сценарий = ПрочитатьJSON(Чтение, Истина);

		ПрочитанныеСценарии.Добавить(Новый Структура("ПутьКФайлу, Сценарий", ТекПуть, Сценарий));

	КонецЦикла;

	Возврат ПрочитанныеСценарии;
	
КонецФункции // ПрочитатьСценарии()

Функция Префикс_ПрочитатьФайл()

	Возврат "scen://";

КонецФункции // Префикс_ПрочитатьФайл()

Функция ПапкаПоискаПоУмолчанию()

	Возврат ТекущийКаталог();

КонецФункции

Функция МаскаПоискаФайлаПоУмолчанию()

	Возврат "scen*.json";

КонецФункции // МаскаПоискаФайлаПоУмолчанию()

Лог = Логирование.ПолучитьЛог("ktb.app.cpdb");