// ----------------------------------------------------------
// This Source Code Form is subject to the terms of the
// Mozilla Public License, v.2.0. If a copy of the MPL
// was not distributed with this file, You can obtain one
// at http://mozilla.org/MPL/2.0/.
// ----------------------------------------------------------
// Codebase: https://github.com/ArKuznetsov/cpdb/
// ----------------------------------------------------------

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт
	
	Команда.ДобавитьКоманду("copy c",
	                        "копировать файл",
	                        Новый КомандаКопироватьФайл());
	
	Команда.ДобавитьКоманду("split s",
	                        "разбить файл на части (используется 7-zip)",
	                        Новый КомандаРазбитьФайлНаЧасти());

	Команда.ДобавитьКоманду("merge m",
	                        "собрать файл из частей (используется 7-zip)",
	                        Новый КомандаСоединитьЧастиВФайл());

	Команда.ДобавитьКоманду("putyadisk py",
	                        "поместить файл на Yandex-диск",
	                        Новый КомандаПоместитьФайлВЯДиск());

	Команда.ДобавитьКоманду("getyadisk gy",
	                        "скачать файл с Yandex-диска",
	                        Новый КомандаПолучитьФайлИзЯДиска());

	Команда.ДобавитьКоманду("putnc pn",
	                        "поместить файл в сервис NextCloud",
	                        Новый КомандаПоместитьФайлВNextCloud());

	Команда.ДобавитьКоманду("getnc gn",
	                        "скачать файл с сервиса NextCloud",
	                        Новый КомандаПолучитьФайлИзNextCloud());

	Команда.ДобавитьКоманду("mapdrive md",
	                        "подключить сетевой диск",
	                        Новый КомандаПодключитьСетевойДиск());

	Команда.ДобавитьКоманду("umapdrive ud",
	                        "отключить сетевой диск",
	                        Новый КомандаОтключитьСетевойДиск());

КонецПроцедуры // ОписаниеКоманды()
