// ----------------------------------------------------------
// This Source Code Form is subject to the terms of the
// Mozilla Public License, v.2.0. If a copy of the MPL
// was not distributed with this file, You can obtain one
// at http://mozilla.org/MPL/2.0/.
// ----------------------------------------------------------
// Codebase: https://github.com/ArKuznetsov/cpdb/
// ----------------------------------------------------------

Перем Лог;                  // - Объект                                - объект записи лога приложения

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт
	
	Команда.ДобавитьКоманду("createib l",
	                        "создать информационную базу 1С на сервере",
	                        Новый КомандаСоздатьСервернуюИБ());
	
	Команда.ДобавитьКоманду("dumpib g",
	                        "выгрузить информационную базу 1С в DT-файл",
	                        Новый КомандаВыгрузитьИБВФайл());
	
	Команда.ДобавитьКоманду("restoreib g",
	                        "загрузить информационную базу 1С из DT-файла",
	                        Новый КомандаЗагрузитьИБИзФайла());
	
	Команда.ДобавитьКоманду("uconstorage g",
	                        "отключить информационную базу 1С от хранилища",
	                        Новый КомандаОтключитьОтХранилища());
	
	Команда.ДобавитьКоманду("constorage g",
	                        "подключить информационную базу 1С к хранилищу",
	                        Новый КомандаПодключитьКХранилищу());

КонецПроцедуры // ОписаниеКоманды()

// Процедура - запускает выполнение команды устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект  описание команды
//
Процедура ВыполнитьКоманду(Знач Команда) Экспорт

КонецПроцедуры // ВыполнитьКоманду()

// Процедура - обработчик события "ПриСозданииОбъекта"
//
// BSLLS:UnusedLocalMethod-off
Процедура ПриСозданииОбъекта()

	Лог = ПараметрыСистемы.Лог();

КонецПроцедуры // ПриСозданииОбъекта()
// BSLLS:UnusedLocalMethod-on
