// ----------------------------------------------------------
// This Source Code Form is subject to the terms of the
// Mozilla Public License, v.2.0. If a copy of the MPL
// was not distributed with this file, You can obtain one
// at http://mozilla.org/MPL/2.0/.
// ----------------------------------------------------------
// Codebase: https://github.com/ArKuznetsov/cpdb/
// ----------------------------------------------------------

#Использовать "../../core"

Перем Лог;       // - Объект      - объект записи лога приложения

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт
	
	Команда.Опция("s src", "", "файл источник")
	       .ТСтрока()
	       .Обязательный()
	       .ВОкружении("CPDB_FILE_COPY_SRC");
	
	Команда.Опция("d dst", "", "файл/каталог приемник")
	       .ТСтрока()
	       .Обязательный()
	       .ВОкружении("CPDB_FILE_COPY_DST");
	
	Команда.Опция("r replace", Ложь, "перезаписывать существующие файлы")
	       .Флаговый()
	       .ВОкружении("CPDB_FILE_COPY_REPLACE");
	
	Команда.Опция("m move delsrc", Ложь, "выполнить перемещение файлов (удалить источник после копирования)")
	       .Флаговый()
	       .ВОкружении("CPDB_FILE_COPY_MOVE");
	
	Команда.Опция("l lastonly", Ложь, "копирование файлов, измененных не ранее текущей даты (параметр /D для xcopy)")
	       .Флаговый()
	       .ВОкружении("CPDB_FILE_COPY_LAST_ONLY");

КонецПроцедуры // ОписаниеКоманды()

// Процедура - запускает выполнение команды устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект  описание команды
//
Процедура ВыполнитьКоманду(Знач Команда) Экспорт

	ВыводОтладочнойИнформации = Команда.ЗначениеОпции("verbose");

	ПараметрыСистемы.УстановитьРежимОтладки(ВыводОтладочнойИнформации);

	Если НЕ ПараметрыПриложения.ОбязательныеПараметрыЗаполнены(Команда) Тогда
		Команда.ВывестиСправку();
		Возврат;
	КонецЕсли;

	Источник        = Команда.ЗначениеОпции("src");
	Приемник        = Команда.ЗначениеОпции("dst");
	Перезаписывать  = Команда.ЗначениеОпции("replace");
	Перемещение     = Команда.ЗначениеОпции("move");
	ТолькоСегодня   = Команда.ЗначениеОпции("lastonly");

	РаботаСФайлами.КомандаСистемыКопироватьФайл(Источник,
	                                            Приемник,
	                                            Перезаписывать,
	                                            Перемещение,
	                                            ТолькоСегодня);

КонецПроцедуры // ВыполнитьКоманду()

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытий

// Процедура - обработчик события "ПриСозданииОбъекта"
//
// BSLLS:UnusedLocalMethod-off
Процедура ПриСозданииОбъекта()

	Лог = ПараметрыСистемы.Лог();

КонецПроцедуры // ПриСозданииОбъекта()
// BSLLS:UnusedLocalMethod-on

#КонецОбласти // ОбработчикиСобытий
