// ----------------------------------------------------------
// This Source Code Form is subject to the terms of the
// Mozilla Public License, v.2.0. If a copy of the MPL
// was not distributed with this file, You can obtain one
// at http://mozilla.org/MPL/2.0/.
// ----------------------------------------------------------
// Codebase: https://github.com/ArKuznetsov/cpdb/
// ----------------------------------------------------------

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт

	Команда.ДобавитьКоманду("put p",
	                        "поместить файл в сервис NextCloud",
	                        Новый КомандаПоместитьФайлВNextCloud());

	Команда.ДобавитьКоманду("get g",
	                        "скачать файл с сервиса NextCloud",
	                        Новый КомандаПолучитьФайлИзNextCloud());

	Команда.Опция("s srvr service", "", "адрес сервиса NextCloud")
	       .ТСтрока()
	       .Обязательный()
	       .ВОкружении("CPDB_NC_SRVR");

	Команда.Опция("u user", "", "Пользователь сервиса NextCloud")
	       .ТСтрока()
	       .Обязательный()
	       .ВОкружении("CPDB_NC_USER");

	Команда.Опция("p pwd", "", "Пароль пользователя сервиса NextCloud")
	       .ТСтрока()
	       .ВОкружении("CPDB_NC_PWD");

КонецПроцедуры // ОписаниеКоманды()
