// ----------------------------------------------------------
// This Source Code Form is subject to the terms of the
// Mozilla Public License, v.2.0. If a copy of the MPL
// was not distributed with this file, You can obtain one
// at http://mozilla.org/MPL/2.0/.
// ----------------------------------------------------------
// Codebase: https://github.com/ArKuznetsov/cpdb/
// ----------------------------------------------------------

Перем Лог;       // - Объект      - объект записи лога приложения

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт
	
	Команда.Опция("f file", "", "путь к локальному файлу для помещения на Yandex-Диск")
	       .ТСтрока()
	       .ВОкружении("CPDB_YD_PUT_FILE");
	
	Команда.Опция("l list", "", "путь к локальному файлу со списком файлов,
	                            |которые будут помещены на Yandex-Диск
	                            |(параметр -file игнорируется)")
	       .ТСтрока()
	       .ВОкружении("CPDB_YD_PUT_LIST");
	
	Команда.Опция("yt ya-token", "", "Token авторизации")
	       .ТСтрока()
	       .Обязательный()
	       .ВОкружении("CPDB_YD_TOKEN");
	
	Команда.Опция("yp ya-path", "", "путь к файлу на Yandex-Диск")
	       .ТСтрока()
	       .Обязательный()
	       .ВОкружении("CPDB_YD_PUT_PATH");
	
	Команда.Опция("ch check-hash", "", "(TBE) Проверять совпадение хешей скопированных файлов")
	       .Флаговый()
	       .ВОкружении("CPDB_YD_PUT_CHECK_HASH");
	
	Команда.Опция("ds delsrc", "", "удалить исходные файлы после отправки")
	       .Флаговый()
	       .ВОкружении("CPDB_YD_PUT_DEL_SRC");
	
	Команда.Опция("r replace", "", "перезаписать файл на Яндекс-диске при загрузке")
	       .Флаговый()
	       .ВОкружении("CPDB_YD_PUT_REPLACE");
	
КонецПроцедуры // ОписаниеКоманды()

// Процедура - запускает выполнение команды устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект  описание команды
//
Процедура ВыполнитьКоманду(Знач Команда) Экспорт

	ВыводОтладочнойИнформации = Команда.ЗначениеОпции("verbose");

	ПараметрыСистемы.УстановитьРежимОтладки(ВыводОтладочнойИнформации);

	Если НЕ ПараметрыПриложения.ОбязательныеПараметрыЗаполнены(Команда) Тогда
		Команда.ВывестиСправку();
		Возврат;
	КонецЕсли;

	Сервер             = Команда.ЗначениеОпции("sql-srvr");
	Пользователь       = Команда.ЗначениеОпции("sql-user");
	ПарольПользователя = Команда.ЗначениеОпции("sql-pwd");
	СкриптыВыполнения  = Команда.ЗначениеОпции("sql-files");
	СтрокаПеременных   = Команда.ЗначениеОпции("sql-vars");

	ЭтоСписокФайлов = Истина;

	ПутьКФайлу              = Команда.ЗначениеОпции("list");
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ПутьКФайлу          = Команда.ЗначениеОпции("file");
		ЭтоСписокФайлов	= Ложь;
	КонецЕсли;
	OAuth_Токен             = Команда.ЗначениеОпции("ya-token");
	ЦелевойПуть             = Команда.ЗначениеОпции("ya-path");
	УдалитьИсточник         = Команда.ЗначениеОпции("delsrc");
	Перезаписывать          = Команда.ЗначениеОпции("replace");
		
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		ВызватьИсключение "Не указан путь к файлу для помещения на Yandex-Диск";
	КонецЕсли;
	
	МассивОтправляемыхФайлов = Новый Массив;
	ФайлИнфо = Новый Файл(ПутьКФайлу);

	ЯндексДиск = Новый ЯндексДиск();
	ЯндексДиск.УстановитьТокенАвторизации(OAuth_Токен);

	// Если целевой путь не указан - тогда используется корень Яндекс-диска
	Если ЗначениеЗаполнено(ЦелевойПуть) Тогда
		// Определяем наличие каталога
		РаботаСФайлами.СоздатьПапкуНаЯДиске(ЯндексДиск, ЦелевойПуть);
	Иначе
		ЦелевойПуть = "";
	КонецЕсли;
	
	Если ЭтоСписокФайлов Тогда
		МассивОтправляемыхФайлов = РаботаСФайлами.ПрочитатьСписокФайлов(ПутьКФайлу);
	КонецЕсли;
	
	// Добавляем файл (или файл-список файлов) списка для закачки на Я-Диск
	МассивОтправляемыхФайлов.Добавить(ФайлИнфо.Имя);

	Для Каждого ОтправляемыйФайл Из МассивОтправляемыхФайлов Цикл
		РаботаСФайлами.ОтправитьФайлНаЯДиск(ЯндексДиск, ФайлИнфо.Путь, ОтправляемыйФайл, ЦелевойПуть, Перезаписывать);

		Если УдалитьИсточник Тогда
			УдалитьФайлы(ОтправляемыйФайл);
			Лог.Информация("Исходный файл %1 удален", ОтправляемыйФайл);
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры // ВыполнитьКоманду()

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытий

// Процедура - обработчик события "ПриСозданииОбъекта"
//
// BSLLS:UnusedLocalMethod-off
Процедура ПриСозданииОбъекта()

	Лог = ПараметрыСистемы.Лог();

КонецПроцедуры // ПриСозданииОбъекта()
// BSLLS:UnusedLocalMethod-on

#КонецОбласти // ОбработчикиСобытий
