// ----------------------------------------------------------
// This Source Code Form is subject to the terms of the
// Mozilla Public License, v.2.0. If a copy of the MPL
// was not distributed with this file, You can obtain one
// at http://mozilla.org/MPL/2.0/.
// ----------------------------------------------------------
// Codebase: https://github.com/ArKuznetsov/cpdb/
// ----------------------------------------------------------

#Использовать "../../core"

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт
	
	Команда.Опция("pp params", "", "Файлы JSON содержащие значения параметров,
	                               | могут быть указаны несколько файлов разделенные "";""")
	       .ТСтрока()
	       .ВОкружении("CPDB_PARAMS");

	Команда.Опция("d drive map-drive", "", "имя устройства (буква диска)")
	       .ТСтрока()
	       .Обязательный()
	       .ВОкружении("CPDB_FILE_MAP_DRIVE");
	
	Команда.Опция("r res map-res", "", "путь к подключаемому ресурсу")
	       .ТСтрока()
	       .Обязательный()
	       .ВОкружении("CPDB_FILE_MAP_RES");
	
	Команда.Опция("u user map-user", "", "пользователь для подключения")
	       .ТСтрока()
	       .ВОкружении("CPDB_FILE_MAP_USER");
	
	Команда.Опция("p pwd map-pwd", "", "пароль пользователя для подключения")
	       .ТСтрока()
	       .ВОкружении("CPDB_FILE_MAP_PWD");

КонецПроцедуры // ОписаниеКоманды()

// Процедура - запускает выполнение команды устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект  описание команды
//
Процедура ВыполнитьКоманду(Знач Команда) Экспорт

	ЧтениеОпций = Новый ЧтениеОпцийКоманды(Команда);

	ВыводОтладочнойИнформации = ЧтениеОпций.ЗначениеОпции("verbose");

	ПараметрыСистемы.УстановитьРежимОтладки(ВыводОтладочнойИнформации);

	ИмяУстройства      = ЧтениеОпций.ЗначениеОпции("drive");
	ИмяРесурса         = ЧтениеОпций.ЗначениеОпции("res");
	Пользователь       = ЧтениеОпций.ЗначениеОпции("user");
	ПарольПользователя = ЧтениеОпций.ЗначениеОпции("pwd");

	РаботаСФайлами.ПодключитьДиск(ИмяУстройства, ИмяРесурса, Пользователь, ПарольПользователя);

КонецПроцедуры // ВыполнитьКоманду()

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
