///////////////////////////////////////////////////////////////////////////////////////////////////
// Прикладной интерфейс

Перем Лог;

Процедура ЗарегистрироватьКоманду(Знач ИмяКоманды, Знач Парсер) Экспорт
	
	ОписаниеКоманды = Парсер.ОписаниеКоманды(ИмяКоманды, "Соединить файл из частей");
	Парсер.ДобавитьИменованныйПараметрКоманды(ОписаниеКоманды, "-v","Количество частей");

	Парсер.ДобавитьПараметрФлагКоманды(ОписаниеКоманды, "-delsource",	"Удалить части после выполнения операции");

	Парсер.ДобавитьКоманду(ОписаниеКоманды);
	
КонецПроцедуры

Функция ВыполнитьКоманду(Знач ПараметрыКоманды) Экспорт
	Сообщить("Пока не реализовано...");

	ВозможныйРезультат = МенеджерКомандПриложения.РезультатыКоманд();
	
	Возврат ВозможныйРезультат.Успех;
КонецФункции

Лог = Логирование.ПолучитьЛог("ktb.app.copydb");