
///////////////////////////////////////////////////////////////////////////////////////////////////
// Прикладной интерфейс

Перем Лог;

Процедура ЗарегистрироватьКоманду(Знач ИмяКоманды, Знач Парсер) Экспорт
	
	ОписаниеКоманды = Парсер.ОписаниеКоманды(ИмяКоманды, "Подключить сетевой диск");

	Парсер.ДобавитьПозиционныйПараметрКоманды(ОписаниеКоманды, "ИмяУстройства", "Имя устройства (буква диска)");
	Парсер.ДобавитьПозиционныйПараметрКоманды(ОписаниеКоманды, "ИмяРесурса", "Путь к подключаемому ресурсу");

	Парсер.ДобавитьИменованныйПараметрКоманды(ОписаниеКоманды, 
		"-map-user",
		"Пользователь для подключения");

	Парсер.ДобавитьИменованныйПараметрКоманды(ОписаниеКоманды, 
		"-map-pwd",
		"Пароль для подключения");

    Парсер.ДобавитьКоманду(ОписаниеКоманды);

КонецПроцедуры

Функция ВыполнитьКоманду(Знач ПараметрыКоманды) Экспорт
    
	ИмяУстройства		= ПараметрыКоманды["ИмяУстройства"];
	ИмяРесурса			= ПараметрыКоманды["ИмяРесурса"];
	Пользователь		= ПараметрыКоманды["-map-user"];
	ПарольПользователя	= ПараметрыКоманды["-map-pwd"];

	ВозможныйРезультат = МенеджерКомандПриложения.РезультатыКоманд();

	Если ПустаяСтрока(ИмяУстройства) Тогда
		Лог.Ошибка("Не указано имя устройства");
		Возврат ВозможныйРезультат.НеверныеПараметры;
	КонецЕсли;

	Если ПустаяСтрока(ИмяРесурса) Тогда
		Лог.Ошибка("Не указано имя подключаемого ресурса");
		Возврат ВозможныйРезультат.НеверныеПараметры;
	КонецЕсли;

	Попытка
		ОписаниеРезультата = "";
		
		Результат = ПодключитьДиск(ИмяУстройства, ИмяРесурса, Пользователь, ПарольПользователя, ОписаниеРезультата);

		Если Не ПустаяСтрока(ОписаниеРезультата) Тогда
			Лог.Информация("Вывод команды: " + ОписаниеРезультата);
		КонецЕсли;
		
		Если НЕ Результат Тогда
			Возврат ВозможныйРезультат.ОшибкаВремениВыполнения;
		КонецЕсли;

		Возврат ВозможныйРезультат.Успех;
	Исключение
		Лог.Ошибка("Вывод команды: " + ОписаниеРезультата + Символы.ПС + ОписаниеОшибки());
		Возврат ВозможныйРезультат.ОшибкаВремениВыполнения;
	КонецПопытки;

КонецФункции

Функция ПодключитьДиск(ИмяУстройства, ИмяРесурса, Пользователь, ПарольПользователя, ОписаниеРезультата = "") Экспорт

	КомандаРК = Новый Команда;
	
	КомандаРК.УстановитьКоманду("net");
	КомандаРК.ДобавитьПараметр("use");
	КомандаРК.ДобавитьПараметр(ИмяУстройства);
	КомандаРК.ДобавитьПараметр(ИмяРесурса);
	КомандаРК.ДобавитьПараметр(ПарольПользователя);
	КомандаРК.ДобавитьПараметр("/USER:" + Пользователь);

	КомандаРК.УстановитьИсполнениеЧерезКомандыСистемы( Ложь );
	КомандаРК.ПоказыватьВыводНемедленно( Ложь );
	
	КодВозврата = КомандаРК.Исполнить();

	ОписаниеРезультата = КомандаРК.ПолучитьВывод();
	
	Возврат КодВозврата = 0;
	
КонецФункции //ПодключитьДиск()

Лог = Логирование.ПолучитьЛог("ktb.app.copydb");